list = ['爱奇艺',54,758,'优酷','腾讯']
print(list[0:2])

list = ['爱奇艺',54,758,'优酷','腾讯','爱奇艺',54,758,'优酷','腾讯','熊猫tv','斗鱼tv',15515]
a = list.count('爱奇艺')
print(a)
list = ['爱奇艺',54,758,'优酷','腾讯','爱奇艺',54,758,'优酷','腾讯','熊猫tv','斗鱼tv',15515]
a = list.pop(0)
print(a)
print(list)
list = ['爱奇艺',54,758,'优酷','腾讯','爱奇艺',54,758,'优酷','腾讯','熊猫tv','斗鱼tv',15515]
list.append('虎牙tv')
print(list)
list = ['爱奇艺',54,758,'优酷','腾讯','爱奇艺',54,758,'优酷','腾讯','熊猫tv','斗鱼tv',15515]
list[1] = '虎牙tv'
print(list)
list = ['爱奇艺',54,758,'优酷','腾讯','爱奇艺',54,758,'优酷','腾讯','熊猫tv','斗鱼tv',15515]
print(len(list))

